
## Plan Result

[CI link](https://github.com/t98s/minecraft-server/actions/runs/2302064072)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * google_storage_bucket_object.gcf-minecraft-starter_zip


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket_object.gcf-minecraft-starter_zip must be replaced
-/+ resource "google_storage_bucket_object" "gcf-minecraft-starter_zip" {
      - cache_control       = "" -> null
      - content_disposition = "" -> null
      - content_encoding    = "" -> null
      - content_language    = "" -> null
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "u5z63g==" -> (known after apply)
      ~ detect_md5hash      = "ctMdjvlZM31nasMX+oWycw==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "t98s-gcf-src-zmgh7qmq-gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip" -> (known after apply)
      ~ kms_key_name        = "" -> (known after apply)
      ~ md5hash             = "ctMdjvlZM31nasMX+oWycw==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/t98s-gcf-src-zmgh7qmq/o/gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip?generation=1652178075103738&alt=media" -> (known after apply)
      - metadata            = {} -> null
        name                = "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip"
      ~ output_name         = "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/t98s-gcf-src-zmgh7qmq/o/gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":22,"Program":"tfcmt","SHA1":"a674503f6d5459e78ff95dfe1ab722d1d793b12b","Vars":{},"WorkflowName":"terraform plan"} -->